tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "1password/tap"
tap "cantino/mcfly"

brew 'awk'
brew 'bash'
brew 'bat'
brew 'cheat'
brew 'chezmoi'
brew 'coreutils'
brew 'devtoys'
brew 'emacs'
brew 'emacs-plus@29'
brew 'fd'
brew 'fdupes'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'gnutils'
brew 'hugo'
brew 'ical-buddy'
brew "cantino/mcfly/mcfly"
brew 'neovim'
brew 'pandoc'
brew 'periscope'
brew 'perl'
brew 'python@3.12'
brew 'ripgrep'
brew 'ruby'
brew 'sd'
brew 'tmux'
brew 'tree-sitter'
brew 'vim'
brew 'zsh'

cask '1password-cli'
cask 'alacritty'
cask 'blockblock'
cask 'calibre'
cask 'devtoys'
cask 'drawio'
cask 'duckduckgo'
cask 'eloston-chromium'
cask 'firefox'
cask 'focus'
cask 'font-code-new-roman-nerd-font'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'hazel'
cask 'iina'
cask 'iterm2'
cask 'kitty'
cask 'lulu'
cask 'mailmate'
cask 'netnewswire'
cask 'noti'
cask 'obs'
cask 'obsidian'
cask 'oversight'
cask 'raycast'
cask 'rectangle'
cask 'skim'
cask 'stats'
cask 'visual-studio-code'
cask 'vlc'
